Source: https://www.youtube.com/watch?v=2uvysYbKdjM&t=12s

### Libraries

In [ ]:
import pandas as pd
import numpy as np

DataFrames

In [ ]:
print(pd.__file__)
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A", "B", "C"], index=["x","y","z",'zz'])
print(df)

In [ ]:
print("5 lines par default")
df.head() # 5 lines par default
df.head(3)

In [ ]:
df.tail(2)

In [ ]:
print("df.index.tolist():")
print(df.index.tolist())

print("\ndf.columns:")
print(df.columns)

print("\ndf.info():")
df.info()

Python Pandas

In [ ]:
df.describe()
#std - standard deviation

In [ ]:
df.nunique()
df['A'].unique()

In [ ]:
df.size # n * m

In [ ]:
df.shape

### Loading in Dataframes from Files

In [ ]:
#results = pd.read_csv('./data/result.csv')
coffee = pd.read_csv('./data/coffee.csv')
bios = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/bios.csv')
results_parquet = pd.read_parquet('./data/results.parquet') # need to be installed pip install pyarrow
regions = pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/noc_regions.csv")
coffee
coffee.sample(10, random_state=1)

In [ ]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name="results")
#need to install 'pip install openpyxl'
olympics_data.head()

In [ ]:
import os
print(os.getcwd())       
print(os.listdir('./'))   
print(os.listdir('./data'))

Accessing Data with Pandas

In [ ]:
# loc
# coffee.loc[Rows, Columns]

print()
print(coffee.loc[0])
print()
print(coffee.loc[[0,1,5]])
print()
print(coffee.loc[5:9, ["Day", "Units Sold"]])
print()
print(coffee.iloc[:, [0,2]])

loc - the name of a row or column, but not the position
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc

iloc - by row or column number (as in Python lists)
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc

Other Stuff

In [ ]:
print()
coffee.index = coffee["Day"] #to change index
print() 
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [ ]:
coffee.loc[1:3, "Units Sold"] = 10 # to set value

# to access only one element
coffee.at[0,"Units Sold"] 
coffee.iat[3,1]

In [ ]:
# to access collums
coffee.Day #if its a single word
coffee["Day"]

In [ ]:
#Sort Values

print()
coffee.sort_values(["Units Sold"])
print()
coffee.sort_values(["Units Sold"], ascending=False)
print()
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0,1])
# 0 → descending
# 1 → ascending

##### Iterate over dataframe with for loop

In [29]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("Coffee Type of Row:", row["Coffee Type"])

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
new_price          3.99
revenue           99.75
Name: 0, dtype: object
Coffee Type of Row: Espresso
1
Day            Monday
Coffee Type     Latte
Units Sold         15
new_price        5.99
revenue         89.85
Name: 1, dtype: object
Coffee Type of Row: Latte
2
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
new_price          3.99
revenue           119.7
Name: 2, dtype: object
Coffee Type of Row: Espresso
3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
new_price         5.99
revenue          119.8
Name: 3, dtype: object
Coffee Type of Row: Latte
4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
new_price           3.99
revenue           139.65
Name: 4, dtype: object
Coffee Type of Row: Espresso
5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
new_price           5.99
revenue           149.75
Name: 5, dtype: object
Coffee Type of Row: Latte
6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
new_price          3.99
revenue           159.6
Name: 6, dtype: object
Coffee Type of Row: Espresso
7
Day            Thursday
Coffee Type       Latte
Units Sold           30
new_price          5.99
revenue           179.7
Name: 7, dtype: object
Coffee Type of Row: Latte
8
Day              Friday
Coffee Type    Espresso
Units Sold           45
new_price          3.99
revenue          179.55
Name: 8, dtype: object
Coffee Type of Row: Espresso
9
Day            Friday
Coffee Type     Latte
Units Sold         35
new_price        5.99
revenue        209.65
Name: 9, dtype: object
Coffee Type of Row: Latte
10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
new_price          3.99
revenue          179.55
Name: 10, dtype: object
Coffee Type of Row: Espresso
11
Day            Saturday
Coffee Type       Latte
Units Sold           35
new_price          5.99
revenue          209.65
Name: 11, dtype: object
Coffee Type of Row: Latte
12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
new_price          3.99
revenue          179.55
Name: 12, dtype: object
Coffee Type of Row: Espresso
13
Day            Sunday
Coffee Type     Latte
Units Sold         35
new_price        5.99
revenue        209.65
Name: 13, dtype: object
Coffee Type of Row: Latte

#### Filtering Data

In [ ]:
bios.head()

In [ ]:
bios.loc[bios["height_cm"] > 215]
bios.loc[bios["height_cm"] > 215, ["name", "height_cm"]]
bios[bios['height_cm'] > 215][["name","height_cm"]] # Short-hand syntax (without .loc)
bios[(bios['height_cm'] > 215) & (bios['born_country']=='USA')] # Multiple filter conditions
bios[bios['name'].str.contains("keith", case=False)] # Filter by string conditions

### Filter by string conditions

In [ ]:
bios[bios['name'].str.contains("keith", case=False)] # Filter by string conditions
bios[bios['name'].str.contains('keith|patrick', case=False)]

In [ ]:
# Other cool regex filters

# Find athletes born in cities that start with a vowel:
vowel_cities = bios[bios['born_city'].str.contains(r'^[AEIOUaeiou]', na=False)]

# Find athletes with names that contain exactly two vowels:
two_vowels = bios[bios['name'].str.contains(r'^[^AEIOUaeiou]*[AEIOUaeiou][^AEIOUaeiou]*[AEIOUaeiou][^AEIOUaeiou]*$', na=False)]

# Find athletes with names that have repeated consecutive letters (e.g., "Aaron", "Emmett"):
repeated_letters = bios[bios['name'].str.contains(r'(.)\1', na=False)]

# Find athletes with names ending in 'son' or 'sen':
son_sen_names = bios[bios['name'].str.contains(r'son$|sen$', case=False, na=False)]

# Find athletes born in a year starting with '19':
born_19xx = bios[bios['born_date'].str.contains(r'^19', na=False)]

# Find athletes with names that do not contain any vowels:
no_vowels = bios[bios['name'].str.contains(r'^[^AEIOUaeiou]*$', na=False)]

# Find athletes whose names contain a hyphen or an apostrophe:
hyphen_apostrophe = bios[bios['name'].str.contains(r"[-']", na=False)]

# Find athletes with names that start and end with the same letter:
start_end_same = bios[bios['name'].str.contains(r'^(.).*\1$', na=False, case=False)]

# Find athletes with a born_city that has exactly 7 characters:
city_seven_chars = bios[bios['born_city'].str.contains(r'^.{7}$', na=False)]

# Find athletes with names containing three or more vowels:
three_or_more_vowels = bios[bios['name'].str.contains(r'([AEIOUaeiou].*){3,}', na=False)]

### Query functions

In [ ]:
bios.query('born_country == "USA" and born_city == "Seattle"')

## Adding / Removing Columns

In [ ]:
coffee['price'] = 4.99
coffee.head()

In [20]:
coffee['new_price'] = np.where(coffee['Coffee Type']=='Espresso', 3.99, 5.99) 
# if the column does not yet exist, it is created

In [21]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

In [ ]:
coffee.drop(columns=['price'], inplace=True) # to delete a column or row
# inplace=True -> to change DataFrame
# inplace=False, by default -> to make a new copy of the DataFrame

# the below would also have worked
# coffee = coffee.drop(columns=['price'])

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html#pandas.DataFrame.drop

In [22]:
coffee = coffee[['Day', 'Coffee Type', 'Units Sold', 'new_price']]
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']
coffee

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       5.99    89.85
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       5.99   119.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       5.99   149.75
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       5.99   179.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       5.99   209.65
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       5.99   209.65
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       5.99   209.65

In [23]:
new_coffee = coffee # a link
new_coffee = coffee.copy() # a copy
new_coffee['price'] = 4.99

In [24]:
coffee

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       5.99    89.85
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       5.99   119.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       5.99   149.75
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       5.99   179.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       5.99   209.65
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       5.99   209.65
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       5.99   209.65

In [25]:
new_coffee

          Day Coffee Type  Units Sold  new_price  revenue  price
0      Monday    Espresso          25       3.99    99.75   4.99
1      Monday       Latte          15       5.99    89.85   4.99
2     Tuesday    Espresso          30       3.99   119.70   4.99
3     Tuesday       Latte          20       5.99   119.80   4.99
4   Wednesday    Espresso          35       3.99   139.65   4.99
5   Wednesday       Latte          25       5.99   149.75   4.99
6    Thursday    Espresso          40       3.99   159.60   4.99
7    Thursday       Latte          30       5.99   179.70   4.99
8      Friday    Espresso          45       3.99   179.55   4.99
9      Friday       Latte          35       5.99   209.65   4.99
10   Saturday    Espresso          45       3.99   179.55   4.99
11   Saturday       Latte          35       5.99   209.65   4.99
12     Sunday    Espresso          45       3.99   179.55   4.99
13     Sunday       Latte          35       5.99   209.65   4.99

In [ ]:
coffee.rename(columns={'new_price': 'price'}, inplace=True)

In [ ]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]
bios_new.query('first_name == "Keith"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [27]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [ ]:
bios_new.to_csv('./data/bios_new.csv', index=False) # index=False -> do not save the index to a file 
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    
    else:
        return 'Heavyweight'
    
bios['Category'] = bios.apply(categorize_athlete, axis=1)
# axis=1 -> rows
# axis=0 -> colums

bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

## Merging & Concatenating Data

In [ ]:
nocs = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/noc_regions.csv')

bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)

usa = bios[bios['born_country']=='USA'].copy()
gbr = bios[bios['born_country']=='GBR'].copy()

new_df = pd.concat([usa,gbr])
new_df.tail()